In [1]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [2]:
## Creating a series by passing a list of values, letting padas create a default integer index : 
s = pd.Series([1,2,3,np.nan,6,8])

In [3]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
## Creating a DataFrame by passing a NumPy array, with a datetime index and labeled columns:

dates = pd.date_range("20130101", periods = 6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4),index = dates,columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  1.452682 -0.465190  0.896081  0.993355
2013-01-02 -0.404456 -0.088847 -0.512948 -0.187207
2013-01-03 -0.786767  0.127398 -1.095258  2.081314
2013-01-04  0.222036 -0.168164  0.929973 -0.679147
2013-01-05 -0.817846  0.184542 -0.348737  0.563571
2013-01-06  1.891755 -0.109631  0.012413 -0.462931

In [7]:
df.iloc[0:3]

                   A         B         C         D
2013-01-01  1.452682 -0.465190  0.896081  0.993355
2013-01-02 -0.404456 -0.088847 -0.512948 -0.187207
2013-01-03 -0.786767  0.127398 -1.095258  2.081314

In [28]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.loc['2013-01-01':'2013-01-04',['A','B']] # since index [start:stop]column is date hence is for restrictions on rows,cols

                   A         B
2013-01-01  1.452682 -0.465190
2013-01-02 -0.404456 -0.088847
2013-01-03 -0.786767  0.127398
2013-01-04  0.222036 -0.168164

In [37]:
#df.info
#df.describe

<bound method NDFrame.describe of                    A         B         C         D
2013-01-01  1.159432  0.200224 -0.887781 -0.603869
2013-01-02 -0.585607  0.146982  1.178364  1.191326
2013-01-03  0.801838  0.300058  0.710779  0.547454
2013-01-04  0.208131 -0.533289  0.829652 -1.705039
2013-01-05  1.773006  0.400466 -0.186935  0.641965
2013-01-06 -0.660986  0.759934  1.347819 -1.407992>

In [18]:
df2 = pd.DataFrame({
    "A": 1.0,
    "B": pd.Timestamp("20130102"),
    "C": pd.Series(1, index=list(range(4)), dtype = "float32"),
    "D": np.array([3]*4 , dtype="int32"),
    "E": pd.Categorical(['test','train','test','train']),
    "F": "foo"
})

In [19]:
df2
# df2.<tab> # for command options

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [21]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object